/*==============================================================================

debugのヘッダ [debug.h]
作成者 : 中西　祐介
作成日 :
--------------------------------------------------------------------------------
■Update :
==============================================================================*/
#ifndef _DEBUG_H_
#define _DEBUG_H_

/*------------------------------------------------------------------------------
ヘッダファイル
------------------------------------------------------------------------------*/
#include "main.h"

/*------------------------------------------------------------------------------
　クラス
 ------------------------------------------------------------------------------*/
class CDebug
{
public:
	CDebug();
	~CDebug();

	static void Init(void);
	static void Uninit(void);
	static void Update(void);
	static void Draw(void);

	static void ClearText(void);
	static void AddText(char* Text);

private:
	static char m_Text[1024];	
	static LPD3DXFONT m_pFont;
};

#endif