/*==============================================================================

CEnergyGaugeの処理 [CEnergyGauge.cpp]
作成者 : 中西　祐介
作成日 :
--------------------------------------------------------------------------------
■Update :
==============================================================================*/

/*------------------------------------------------------------------------------
　ヘッダファイル
 ------------------------------------------------------------------------------*/
#include "main.h"
#include "modeGame.h"
#include "textureManager.h"
#include "renderer.h"
#include "energyGauge.h"
#include "camera.h"
#include "light.h"

/*------------------------------------------------------------------------------
 　マクロ定義
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
  　デストラクタ
------------------------------------------------------------------------------*/
CEnergyGauge::~CEnergyGauge()
{
}

/*------------------------------------------------------------------------------
　初期化
------------------------------------------------------------------------------*/
void CEnergyGauge::Init(void)
{
	// 初期化
	CScene2D::Init();

	// オブジェクトタイプの設定
	SetObjType(OBJTYPE_NONE);
}

/*------------------------------------------------------------------------------
　終了処理
 ------------------------------------------------------------------------------*/
void CEnergyGauge::Uninit(void)
{
	CScene2D::Uninit();
	CScene::SetDelete();
}

/*------------------------------------------------------------------------------
　更新
 ------------------------------------------------------------------------------*/
void CEnergyGauge::Update(void)
{
	m_size.x = CModeGame::GetPlayer()->GetEnergy() * 6.5f;
	m_pos.x = 120.0f + m_size.x * 0.5f;
	CScene2D::Update();
}

/*------------------------------------------------------------------------------
　ポリゴン描画処理
 ------------------------------------------------------------------------------*/
void CEnergyGauge::Draw(void)
{
	CScene2D::Draw();
}

/*------------------------------------------------------------------------------
　作成
 ------------------------------------------------------------------------------*/
CEnergyGauge* CEnergyGauge::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, float alpha, char* filePass, CTextureManager::TEXTYPE textype)
{
	CEnergyGauge* pTextBox = new CEnergyGauge(CScene::PRIORITY_2D);

	// 初期化
	pTextBox->SetPos(pos);
	pTextBox->SetAlpha(alpha);
	pTextBox->SetSize(size);

	// テクスチャのロード
	pTextBox->SetTexID(CTextureManager::LoadTexture(filePass, textype));
	pTextBox->Init();

	return pTextBox;
}

