/*==============================================================================

    gangの処理 [gang.cpp]
                                                       作成者 : 中西　祐介
                                                       作成日 : 
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/

/*------------------------------------------------------------------------------
  　ヘッダファイル
------------------------------------------------------------------------------*/
#include "main.h"
#include "manager.h"
#include "modeGame.h"
#include "renderer.h"
#include "gang.h"
#include "camera.h"
#include "light.h"

/*------------------------------------------------------------------------------
  　マクロ定義
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
  　デストラクタ
------------------------------------------------------------------------------*/
CGang::~CGang()
{
}

/*------------------------------------------------------------------------------
  　初期化
------------------------------------------------------------------------------*/
void CGang::Init( D3DXVECTOR3 pos, D3DXVECTOR3 size, char* filepass )
{
	// テクスチャのロード
	m_TexID = CTextureManager::LoadTexture(filepass, CTextureManager::TEXTYPE_NONE);

	// パラメータ設定
	m_size = size;
	m_pos = pos;
	m_color.a = 1.0f;

	// ビルボードの初期化
	CScene2D::Init();

	// オブジェクトタイプの設定
	SetObjType( OBJTYPE_GANG );
}

/*------------------------------------------------------------------------------
  　終了処理
------------------------------------------------------------------------------*/
void CGang::Uninit( void )
{
}

/*------------------------------------------------------------------------------
  　更新
------------------------------------------------------------------------------*/
void CGang::Update( void )
{
	POINT pos;
	pos = CModeGame::GetCurPos();
	m_pos = D3DXVECTOR3(pos.x, pos.y, 0.0f);
	m_leftup = D3DXVECTOR2(m_pos.x - m_size.x * 0.5f, m_pos.y - m_size.y * 0.5f);
	m_rightup = D3DXVECTOR2(m_pos.x + m_size.x * 0.5f, m_pos.y - m_size.y * 0.5f);
	m_leftdown = D3DXVECTOR2(m_pos.x - m_size.x * 0.5f, m_pos.y + m_size.y * 0.5f);
	m_rightdown = D3DXVECTOR2(m_pos.x + m_size.x * 0.5f, m_pos.y + m_size.y * 0.5f);

	CScene2D::Update();
}

/*------------------------------------------------------------------------------
  　ポリゴン描画処理
------------------------------------------------------------------------------*/
void CGang::Draw( void )
{		
	CScene2D::Draw();
}

/*------------------------------------------------------------------------------
  　作成
------------------------------------------------------------------------------*/
CGang* CGang::Create( D3DXVECTOR3 pos, D3DXVECTOR3 size, char* filepass )
{
	CGang* pGang = new CGang( 2 );
	pGang->Init( pos, size, filepass );
	return pGang;
}

