/*==============================================================================

hitpointGaugeの処理 [hitpointGauge.cpp]
作成者 : 中西　祐介
作成日 :
--------------------------------------------------------------------------------
■Update :
==============================================================================*/

//------------------------------------------------------------------------------
//　ヘッダファイル
//------------------------------------------------------------------------------
#include "main.h"
#include "modeGame.h"
#include "textureManager.h"
#include "renderer.h"
#include "hitpointGauge.h"
#include "camera.h"
#include "light.h"

//------------------------------------------------------------------------------
// 　マクロ定義
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//  デストラクタ
//------------------------------------------------------------------------------
CHitpointGauge::~CHitpointGauge()
{
}

//------------------------------------------------------------------------------
//　初期化
//------------------------------------------------------------------------------
void CHitpointGauge::Init(void)
{
	// 初期化
	CScene2D::Init();

	// オブジェクトタイプの設定
	SetObjType(OBJTYPE_NONE);
}

//------------------------------------------------------------------------------
//　終了処理
//------------------------------------------------------------------------------
void CHitpointGauge::Uninit(void)
{
	CScene2D::Uninit();
	CScene::SetDelete();
}

//------------------------------------------------------------------------------
//　更新
//------------------------------------------------------------------------------
void CHitpointGauge::Update(void)
{
	m_size.x = CModeGame::GetPlayer()->GetHitpoint() * 6.5f;
	m_pos.x = 120.0f + m_size.x * 0.5f;
	CScene2D::Update();
}

//------------------------------------------------------------------------------
//　ポリゴン描画処理
//------------------------------------------------------------------------------
void CHitpointGauge::Draw(void)
{
	CScene2D::Draw();
}

//------------------------------------------------------------------------------
//　作成
//------------------------------------------------------------------------------
CHitpointGauge* CHitpointGauge::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, float alpha, char* filePass, CTextureManager::TEXTYPE textype)
{
	CHitpointGauge* pTextBox = new CHitpointGauge(CScene::PRIORITY_2D);

	// 初期化
	pTextBox->SetPos(pos);
	pTextBox->SetAlpha(alpha);
	pTextBox->SetSize(size);

	// テクスチャのロード
	pTextBox->SetTexID(CTextureManager::LoadTexture(filePass, textype));
	pTextBox->Init();

	return pTextBox;
}

