/*==============================================================================

mediatorのヘッダー [mediator.h]
作成者 : 中西　祐介
作成日 :
--------------------------------------------------------------------------------
■Update :
==============================================================================*/
#ifndef _MEDIATOR_H_
#define _MEDIATOR_H_

//------------------------------------------------------------------------------
//  ヘッダファイル
//------------------------------------------------------------------------------
#include "enemy.h"
#include "rockon.h"

//------------------------------------------------------------------------------
//  マクロ定義
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//  クラス
//------------------------------------------------------------------------------
class CMediator
{
public:

	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void) {};

	// ゲッター

	// セッター
	void SetEnemy(CEnemy* Enemy) { m_Enemy = Enemy; }
	void SetRockon(CRockon* Rockon) { m_Rockon = Rockon; }

	static CMediator* Create(CEnemy* enemy, CRockon* Rockon);

private:
	CEnemy* m_Enemy;
	CRockon* m_Rockon;
	bool m_Delete;

};

#endif
