/*==============================================================================

    modeTutorialのヘッダー [modeTutorial.h]
                                                       作成者 : 中西　祐介
                                                       作成日 : 
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/
#ifndef _MODE_TUTORIAL_H_
#define _MODE_TUTORIAL_H_

/*------------------------------------------------------------------------------
  　ヘッダファイル
------------------------------------------------------------------------------*/
#include "mode.h"
#include "background.h"

/*------------------------------------------------------------------------------
  　マクロ定義
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
  　クラス
------------------------------------------------------------------------------*/
class CModeTutorial: public CMode
{
public:
	CModeTutorial() {};
	~CModeTutorial() ;
	
	void Init( void)override;
	void Uninit( void )override;
	void Update( void )override;
	void Draw( void )override;
	
	// ゲッター

	// その他のメソッド
	
private:
	// オブジェクト
	static CBackground* m_background;

	// その他
	int m_page; // ページ数
};

#endif