/*==============================================================================

pointPlayerの処理 [pointPlayer.cpp]
作成者 : 中西　祐介
作成日 :
--------------------------------------------------------------------------------
■Update :
==============================================================================*/

/*------------------------------------------------------------------------------
　ヘッダファイル
 ------------------------------------------------------------------------------*/
#include "main.h"
#include "modeGame.h"
#include "textureManager.h"
#include "renderer.h"
#include "pointPlayer.h"
#include "camera.h"
#include "light.h"

 /*------------------------------------------------------------------------------
 　マクロ定義
  ------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
  　デストラクタ
------------------------------------------------------------------------------*/
CPointPlayer::~CPointPlayer()
{
}

/*------------------------------------------------------------------------------
　初期化
------------------------------------------------------------------------------*/
void CPointPlayer::Init(void)
{
	// ビルボードの初期化
	CScene2D::Init();

	// オブジェクトタイプの設定
	SetObjType(OBJTYPE_NONE);
}

/*------------------------------------------------------------------------------
　終了処理
 ------------------------------------------------------------------------------*/
void CPointPlayer::Uninit(void)
{
	CScene2D::Uninit();
	CScene::SetDelete();
}

/*------------------------------------------------------------------------------
　更新
 ------------------------------------------------------------------------------*/
void CPointPlayer::Update(void)
{
	m_pos.x = (CModeGame::GetPlayer()->GetPos().x + 150.0f) * 0.3f;
	m_pos.y = (CModeGame::GetPlayer()->GetPos().z + 150.0f) * 0.3f;

	CScene2D::Update();
}

/*------------------------------------------------------------------------------
　ポリゴン描画処理
 ------------------------------------------------------------------------------*/
void CPointPlayer::Draw(void)
{
	CScene2D::Draw();
}

/*------------------------------------------------------------------------------
　作成
 ------------------------------------------------------------------------------*/
CPointPlayer* CPointPlayer::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, float alpha, char* filePass, CTextureManager::TEXTYPE textype)
{
	CPointPlayer* pTextBox = new CPointPlayer(CScene::PRIORITY_2D);

	// 初期化
	//pos *= 0.1f;
	pTextBox->SetPos(pos);
	pTextBox->SetAlpha(alpha);
	pTextBox->SetSize(size);

	// テクスチャのロード
	pTextBox->SetTexID(CTextureManager::LoadTexture(filePass, textype));
	pTextBox->Init();

	return pTextBox;
}

