/*==============================================================================

    sound処理のヘッダ [sound.h]
                                                       作成者 : 田中　章
                                                       作成日 : 
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/

/*------------------------------------------------------------------------------
  　ヘッダファイル
------------------------------------------------------------------------------*/
#ifndef _SOUND_H_
#define _SOUND_H_

#include <xaudio2.h>	// サウンド
#include "main.h"

/*------------------------------------------------------------------------------
    サウンドファイル
------------------------------------------------------------------------------*/
typedef enum
{
	SOUND_LABEL_BGM000 = 0,		// BGM0
	SOUND_LABEL_BGM001,			// BGM1
	SOUND_LABEL_SE_SHOT,		// 弾発射音
	SOUND_LABEL_SE_LASER,		// 弾発射音
	SOUND_LABEL_SE_MISSILE,			// ヒット音
	SOUND_LABEL_SE_EXPLOSION,	// 爆発音
	SOUND_LABEL_MAX,
} SOUND_LABEL;

/*------------------------------------------------------------------------------
   プロトタイプ宣言
------------------------------------------------------------------------------*/
HRESULT InitSound(HWND hWnd);
void UninitSound(void);
HRESULT PlaySound(SOUND_LABEL label);
void StopSound(SOUND_LABEL label);
void StopSound(void);

#endif
