/*==============================================================================

    textureのヘッダ [texture.h]
                                                       作成者 : 中西　祐介
                                                       作成日 : 2016/5/31
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/
#ifndef _TEXTURE_H_
#define _TEXTURE_H_

/*------------------------------------------------------------------------------
    ヘッダファイル
------------------------------------------------------------------------------*/
#include "main.h"

/*------------------------------------------------------------------------------
  　クラス
------------------------------------------------------------------------------*/
class CTexture
{
public:
	CTexture( char* filepass);
	~CTexture();

	void Init( void );
	void Uninit( void );
	void Release( void );
	
	char* GetTexpass( void );
	LPDIRECT3DTEXTURE9 GetTexPointer( void );
	
private:	
	LPDIRECT3DTEXTURE9 m_pTexture;
	char* m_filepass;
};

#endif