/*==============================================================================

textBoxの処理 [textBox.cpp]
作成者 : 中西　祐介
作成日 :
--------------------------------------------------------------------------------
■Update :
==============================================================================*/

/*------------------------------------------------------------------------------
　ヘッダファイル
 ------------------------------------------------------------------------------*/
#include "main.h"
#include "modeGame.h"
#include "textureManager.h"
#include "renderer.h"
#include "textBox3D.h"
#include "camera.h"
#include "light.h"

 /*------------------------------------------------------------------------------
 　マクロ定義
  ------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
  　デストラクタ
------------------------------------------------------------------------------*/
CTextBox3D::~CTextBox3D()
{
}

/*------------------------------------------------------------------------------
　初期化
 ------------------------------------------------------------------------------*/
void CTextBox3D::Init(void)
{
	// ビルボードの初期化
	CBillboard::Init();

	// オブジェクトタイプの設定
	SetObjType(OBJTYPE_NONE);
}

/*------------------------------------------------------------------------------
　終了処理
 ------------------------------------------------------------------------------*/
void CTextBox3D::Uninit(void)
{
	//CScene2D::Uninit();
	//CScene::Release();
	CScene::SetDelete();
}

/*------------------------------------------------------------------------------
　更新
 ------------------------------------------------------------------------------*/
void CTextBox3D::Update(void)
{
	if (m_use)
	{
		CBillboard::Update();
	}
}

/*------------------------------------------------------------------------------
　ポリゴン描画処理
 ------------------------------------------------------------------------------*/
void CTextBox3D::Draw(void)
{
	if (m_use)
	{
		CBillboard::Draw();
	}
}

/*------------------------------------------------------------------------------
　作成
 ------------------------------------------------------------------------------*/
CTextBox3D* CTextBox3D::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXVECTOR3 endPos, D3DXVECTOR3 endSize, int life, float alpha, char* filePass, CTextureManager::TEXTYPE textype)
{
	CTextBox3D* pTextBox3D = new CTextBox3D(CScene::PRIORITY_2D);

	// 初期化
	pTextBox3D->SetPos(pos);
	pTextBox3D->SetEndPos(endPos);
	pTextBox3D->SetAlpha(alpha);
	pTextBox3D->SetSize(size);
	pTextBox3D->SetEndSize(endSize);
	pTextBox3D->SetLife(life);
	pTextBox3D->SetDefaultLife(life);

	// テクスチャのロード
	pTextBox3D->SetTexID(CTextureManager::LoadTexture(filePass, textype));
	pTextBox3D->Init();

	return pTextBox3D;
}

/*------------------------------------------------------------------------------
　リセット
 ------------------------------------------------------------------------------*/
void CTextBox3D::Reset(void)
{
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_alpha = 255;
	m_life = m_defaultLife;
}