/*==============================================================================

textBoxの処理 [textBox.cpp]
作成者 : 中西　祐介
作成日 :
--------------------------------------------------------------------------------
■Update :
==============================================================================*/

/*------------------------------------------------------------------------------
　ヘッダファイル
 ------------------------------------------------------------------------------*/
#include "main.h"
#include "modeGame.h"
#include "textureManager.h"
#include "renderer.h"
#include "textBox.h"
#include "camera.h"
#include "light.h"

 /*------------------------------------------------------------------------------
 　マクロ定義
  ------------------------------------------------------------------------------*/

  /*------------------------------------------------------------------------------
  　デストラクタ
   ------------------------------------------------------------------------------*/
CTextBox::~CTextBox()
{
}

/*------------------------------------------------------------------------------
　初期化
 ------------------------------------------------------------------------------*/
void CTextBox::Init(void)
{
	// ビルボードの初期化
	CScene2D::Init();

	// オブジェクトタイプの設定
	SetObjType(OBJTYPE_NONE);
}

/*------------------------------------------------------------------------------
　終了処理
 ------------------------------------------------------------------------------*/
void CTextBox::Uninit(void)
{
	//CScene2D::Uninit();
	//CScene::Release();
	CScene::SetDelete();
}

/*------------------------------------------------------------------------------
　更新
 ------------------------------------------------------------------------------*/
void CTextBox::Update(void)
{
	CScene2D::Update();
}

/*------------------------------------------------------------------------------
　ポリゴン描画処理
 ------------------------------------------------------------------------------*/
void CTextBox::Draw(void)
{
	CScene2D::Draw();
}

/*------------------------------------------------------------------------------
　作成
 ------------------------------------------------------------------------------*/
CTextBox* CTextBox::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXVECTOR3 endPos, D3DXVECTOR3 endSize,  float alpha, char* filePass, CTextureManager::TEXTYPE textype)
{
	CTextBox* pTextBox = new CTextBox(CScene::PRIORITY_2D);

	// 初期化
	pTextBox->SetPos(pos);
	pTextBox->SetEndPos(endPos);
	pTextBox->SetAlpha(alpha);
	pTextBox->SetSize(size);
	pTextBox->SetEndSize(endSize);

	// テクスチャのロード
	pTextBox->SetTexID(CTextureManager::LoadTexture(filePass, textype));
	pTextBox->Init();

	return pTextBox;
}

