/*==============================================================================

tombstoneのヘッダー [tombstone.h]
作成者 : 中西　祐介
作成日 :
--------------------------------------------------------------------------------
■Update :
==============================================================================*/
#ifndef _TOMBSTONE_H_
#define _TOMBSTONE_H_

/*------------------------------------------------------------------------------
　ヘッダファイル
------------------------------------------------------------------------------*/
#include "sceneModel.h"

/*------------------------------------------------------------------------------
 　マクロ定義
------------------------------------------------------------------------------*/
#define MAX_TOMBSTONE (50)

//-------------------------------------------------------------------------------
//　クラス
//-------------------------------------------------------------------------------
class CTombstone : public CSceneModel
{
public:
	CTombstone(int Priority) : CSceneModel(Priority) {};
	~CTombstone();

	void Init(D3DXVECTOR3 pos, char* filePass);
	void Uninit(void);
	void Draw(void);

	static CTombstone* Create(D3DXVECTOR3 pos, float rotThe, float rotFai, char* filePass);

private:

};

#endif
