/*==============================================================================

    weedの処理 [weed.cpp]
                                                       作成者 : 中西　祐介
                                                       作成日 : 
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/

/*------------------------------------------------------------------------------
  　ヘッダファイル
------------------------------------------------------------------------------*/
#include "main.h"
#include "modeGame.h"
#include "textureManager.h"
#include "renderer.h"
#include "weed.h"
#include "camera.h"
#include "light.h"

/*------------------------------------------------------------------------------
  　マクロ定義
------------------------------------------------------------------------------*/
#define WEED001_TEXTURENAME "data/TEXTURE/weed001.png"
#define WEED002_TEXTURENAME "data/TEXTURE/weed002.png"
#define WEED003_TEXTURENAME "data/TEXTURE/weed003.png"

/*------------------------------------------------------------------------------
  　デストラクタ
------------------------------------------------------------------------------*/
CWeed::~CWeed()
{
}

/*------------------------------------------------------------------------------
  　初期化
------------------------------------------------------------------------------*/
void CWeed::Init( D3DXVECTOR3 pos, D3DXVECTOR3 size, int type )
{
	// テクスチャの読み込み
	char* filename;
	switch( type )
	{
	case 0:
		filename = WEED001_TEXTURENAME;
		break;
	case 1:
		filename = WEED002_TEXTURENAME;
		break;
	case 2:
		filename = WEED003_TEXTURENAME;
		break;
	}

	// テクスチャのロード
	m_TexID = CTextureManager::LoadTexture( filename, CTextureManager::TEXTYPE_NONE);

	// パラメータ設定
	m_size = size;
	m_pos = pos;

	// 高さ設定
	m_pos.y = CModeGame::GetMeshField()->GetHeight( m_pos ) - m_size.y * 0.07f;
	
	// ビルボードの初期化
	CBillboard::Init();

	// オブジェクトタイプの設定
	SetObjType( OBJTYPE_MESHFIELD );
}

/*------------------------------------------------------------------------------
  　終了処理
------------------------------------------------------------------------------*/
void CWeed::Uninit( void )
{
}

/*------------------------------------------------------------------------------
  　更新
------------------------------------------------------------------------------*/
void CWeed::Update( void )
{
}

/*------------------------------------------------------------------------------
  　ポリゴン描画処理
------------------------------------------------------------------------------*/
void CWeed::Draw( void )
{		
	CBillboard::Draw();
}

/*------------------------------------------------------------------------------
  　作成
------------------------------------------------------------------------------*/
CWeed* CWeed::Create( D3DXVECTOR3 pos, D3DXVECTOR3 size, int type )
{
	CWeed* pWeed = new CWeed( 2 );
	pWeed->Init( pos, size, type );
	return pWeed;
}

